import SingleTestimonialComponent, { Testimonial } from "./SingleTestimonialComponent";

function TestimonialsComponent() {
  const TestimonialList : Array<Testimonial>  = [
    {
      id: 1,
      name: "علی جلالی",
      text: "من در چند دوره‌ی ویدیویی و حضوری آموزش برنامه نویسی شرکت کرده بودم، ولی با حضور در دوره‌های ری‌اکت و نود جی‌اس استاد صدری به عمیق‌ترین مفاهیم برنامه نویسی جاوااسکریپت پی بردم. روش تدریس ایشون رو تا به حال در هیچ کدوم از دوره‌های مشابه ندیده بودم. از مفاهیم بسیار ساده شروع شده و پله پله بدون اینکه کسی لحظه‌ای از کلاس عقب بمونه تمام حاضرین رو تا رسیدن به پیشرفته‌ترین مراحل با خودشون همراه می‌کردن. من به شخصه کل پیشرفت‌هایی که در زمینه برنامه نویسی داشتم رو مدیون ایشون هستم. بعد از اتمام دوره‌ها توسط ایشون به یک شرکت دانش بنیان معرفی شدم و هم اکنون با این شرکت در حال همکاری هستم.",
      imgURL:
        "https://frontcast.ir/wp-content/themes/frontcast-5-0-0/images/jalali.jpg",
    },
    {
      id: 2,
      name: "سودا مجتهدی",
      text: "یکی از دلایل مهمی که باعث تمایز دوره‌های فرانت کست از بقیه می‌شه تایم کوتاه ویدیوها و کیفیت بسیار بالای اون‌هاست. به شکلی که پیچیده‌ترین مفاهیم به‌صورت خیلی ساده به دانشجو منتقل می‌شه و دلیل این هم فقط تسلط بسیار عالی استاد صدری روی مباحث و قدرت انتقال قوی ایشون هست. این موضوع خیلی کمک می‌کنه که فرآیند یادگیری اصلا خسته‌کننده نباشه. همینطور چالش‌ها و تمرین‌هایی که در طول دوره مطرح می‌شه خیلی کمک می‌کنه تا یادگیری مفاهیم به شکل عمیق صورت بگیره و یه انگیزه خیلی قوی هم برای ادامه دادن مسیر هست.",
      imgURL:
        "https://frontcast.ir/wp-content/themes/frontcast-5-0-0/images/mojtahedi.jpg",
    },
    {
      id: 3,
      name: "پرستو پورمحمد",
      text: "یکی از معدود اساتیدی که واقعا براشون مهمه که دانشجوها مطلب رو دقیق و کامل یاد بگیرن، برای همین با مطرح کردن سوالات و تمرین‌های متنوع و مفید، انگیزه قوی برای یادگیری ایجاد می کنن که نوع تدریس، نشان دهنده تسلط کامل روی مطلب هست. همیشه روی کد نویسی اصولی خیلی تاکید می‌کنن که این کار، برای دسترسی سریع به کدها و رفع خطای کد خیلی مهم و کاربردی هست، برای خود منم توجه به این موضوع خیلی مفید بوده همیشه.",
      imgURL:
        "https://frontcast.ir/wp-content/themes/frontcast-5-0-0/images/purmohammad.jpg",
    },
    {
      id: 4,
      name: "مجتبی فرجپور",
      text: "در كلاس طراحى و مبانى برنامه نويسى وب با استاد صدرى آشنا شدم و با توجه به تسلط كامل و قدرت بيان قوى علاقه‌ام به برنامه نويسى بيشتر شد و دوره هاى جاوااسكريپت و ري‌اكت را با جناب آقاى صدرى ادامه دادم و الان تو شركت دانش بنيان مشغول به كار هستم. پيشنهاد مي‌كنم اگر واقعا علاقه‌مند به برنامه نويسى هستيد دوره‌هاى آقاى صدرى را از دست ندید.",
      imgURL:
        "https://frontcast.ir/wp-content/themes/frontcast-5-0-0/images/farajpour.jpg",
    },
    {
      id: 5,
      name: "شبنم میرزایی",
      text: "در کلاس جاوا اسکریپت با استاد صدری آشنا شدم. تدریس عالی و تشویقهای مستمرشون باعث شد بعد از وقفه طولانی دوباره به سمت برنامه نویسی برگردم. در کلاسهای نود ایشون شرکت کردم و علاوه بر اون از ویدیوهای آموزشی ری اکت و آخرین ویدیوهای بی نظیر نود ایشون استفاده زیادی بردم. خیلی خیلی خوشحالم که باهاشون آشنا شدم؛ کاش که خیلیی زودتر این اتفاق افتاده بود.",
      imgURL:
        "https://frontcast.ir/wp-content/themes/frontcast-5-0-0/images/mirzaei.jpg",
    },
    {
      id: 6,
      name: "محمد مهدی ملک زاده",
      text: 'زبان جاوااسکریپت رو با اولین دوره‌ی فرانت‌کست یعنی "شروع برنامه نویسی با جاوااسکریپت" شروع کردم. همونجا بود که بخاطر سبک تدریس فوق‌العاده استاد صدری، علاقه بسیار زیادی به این زبان پیدا کردم و خیلی راحت یاد گرفتم. در ادامه وقتی خواستم Node و React رو شروع کنم از ویدئوهای استاد صدری استفاده کردم و همیشه فرانت‌کست، بهترین گزینه من برای زمانی بود که میخواستم تکنولوژی جدیدی رو یاد بگیرم. این دوره‌ها به قدری کامل هستن که نیازی به هیچ منبع دیگه‌ای نیست و میشه خیلی راحت میشه پروژه کار کرد. حتی وقتی بخوای تو تکنولوژی‌ای عمیق‌تر بشی، بخاطر پایه قوی‌ای که این ویدئوها ایجاد میکنن، کار خیلی سریع و راحت میشه.',
      imgURL:
        "https://frontcast.ir/wp-content/themes/frontcast-5-0-0/images/malekzadeh.jpg",
    },
  ];
  return (
    <div className="mt-40 text-start">
      <h1 className="text-[32px] font-bold mb-10">
        از زبان دانشجویان فرانت کست
      </h1>
      <div className="mx-10 grid grid-cols-1 md:grid-cols-2 xl:grid-cols-3 gap-4 md:gap-6 xl:gap-8">
        {TestimonialList.map((item) => <SingleTestimonialComponent testimonial={item}/>)}
      </div>
    </div>
  );
}

export default TestimonialsComponent;
