const products = [
    {
        id: 1,
        title: "آموزش React – مقدماتی تا پیشرفته",
        status: "تکمیل شده",
        price: "890,000",
        thumbnail: "/static/images/1.png",
        url: "/static/videos/1.mp4",
        description: "React محبوب‌ترین کتابخانه جاوااسکریپت است که از آن برای توسعه قسمت رابط کاربری استفاده می‌شود. براساس آمارهای موجود در وب‌سایت‌های stackoverflow و state of js و همینطور تعداد دانلودهای NPM، کتابخانه React بسیار رو به رشد بوده و در پنج سال اخیر در صدر محبوب‌ترین تکنولوژی‌ها قرار گرفته است.همین موضوع باعث شده است تا بسیاری از شرکت‌ها و استارت‌آپ‌ها برای توسعه محصولات خود از React استفاده کنند.",
        studentsCount: "195 دانشجو",
        timeCourse: "۷ ساعت و ۴۵ دقیقه",
        sesions: [
            {
                title: 'مفاهیم اصلی TypeScript',
                description: ["معرفی دوره", "پیش‌نیازها", "ساختار دوره", "استفاده از TypeScript", "نصب TypeScript"]
            },
            {
                title: 'مبانی React',
                description: ['بررسی ساختار React', "مفاهیم اصلی در React", "استفاده از React و TypeScript"]
            },
            {
                title: 'مفاهیم پیشرفته React',
                description: ['توسعه کامپوننت Wrapper', "ساختار کامپوننت‌های پیشرفته‌تر", "کار با Type Predicates", "بررسی کامپوننت‌های Polymorphic"]
            },


        ]

    },

    {
        id: 2,
        title: "آموزش Next.js – دوره جامع",
        status: "تکمیل شده",
        price: "870,000",
        thumbnail: "/static/images/2.jpg",
        url: "/static/videos/2.mp4",
        description: "Next.js یک فریم‌ورک متن باز برای توسعه نرم‌افزارهای تحت وب است. این فریم‌ورک براساس کتابخانه React ساخته شده. React روی مباحث UI و مفاهیمی مثل کامپوننت، state و props تمرکز دارد. از این ‌رو، یک کتابخانه به ‌حساب می‌آید که از آن برای پیاده‌سازی UIهای پیچیده‌تر استفاده می‌کنیم. اگر بخواهیم یک برنامه با مقیاس بزرگ‌تر با استفاده از React توسعه دهیم به موارد دیگری از جمله پکیج‌های Routing نیاز خواهیم داشت.",
        studentsCount: "645 دانشجو",
        timeCourse: "۱۵ ساعت و ۱۰ دقیقه",
        sesions: [
            {
                title: "مقدمه",
                description: ["پیش‌نیازهای دوره", "ساختار دوره و پشتیبانی", " بررسی Next.js", " امکانات Next.js", "راه اندازی محیط توسعه"]
            },
            {
                title: "ببرسی مفاهیم routing",
                description: [" بررسی Routing در Next.js", "مقادیر Static در Routeهای زیرمجموعه", "مقادیر Dynamic در Routeها"]
            },

        ]

    },
    {
        id: 3,
        title: "آموزش جاوااسکریپت – مفاهیم پیشرفته",
        status: "رایگان",
        price: "0",
        thumbnail: "/static/images/3.jpg",
        url: "/static/videos/3.mp4",
        description: "پیش‌نیاز این دوره درک مفاهیم زبان برنامه نویسی جاوااسکریپت است. اگر دانش قبلی از جاوااسکریپت ندارید پیشنهاد ما آموزش جاوااسکریپت – دوره جامع می‌باشد که چالش‌ و پروژه‌ محور بوده و از پایه‌ای‌ترین مفاهیم جاوااسکریپت شروع می‌شود و تا قسمت‌های پیشرفته‌تر ادامه پیدا می‌کند. اگر با جاوااسکریپت آشنا هستید و قصد مرور و یادآوری مفاهیم را دارید، آموزش جاوااسکریپت – دوره فشرده کانال یوتیوب را به شما پیشنهاد می‌کنیم. این دوره یک منبع به‌روز است که می‌توانید در کوتاه‌ترین زمان مفاهیم اصلی این زبان را بررسی کنید.",
        studentsCount: "1549 دانشجو",
        timeCourse: "۱ ساعت و ۴۰ دقیقه",
        sesions: [
            {
                title: "پیش نیاز دوره",
                description: ["بررسی Scope محلی و سراسری", " روش کار Scope", "مفهوم ‌Block Scope", "مفهوم Hoisting", "استفاده از Let و Const"]
            },
        ]

    },
    {
        id: 4,
        title: "آموزش TypeScript – دوره جامع",
        status: "تکمیل شده",
        price: "690,000 ",
        thumbnail: "/static/images/4.jpg",
        url: "/static/videos/4.mp4",
        description: "زبان برنامه نویسی TypeScript یک زبان متن باز است. کدهایی که به زبان تایپ اسکریپت نوشته می‌شوند به راحتی می‌توانند به زبان جاوااسکریپت تبدیل شوند، همینطور تایپ اسکریپت با اضافه کردن سینکتس‌هایی به جاوااسکریپت، کمک می‌کند تا یکپارچگی بیشتری بین کدها وجود داشته باشد و از بسیاری از خطاهای حین اجرا جلوگیری شود.",
        studentsCount: "582 دانشجو",
        timeCourse: "۶ ساعت و ۱۰ دقیقه",
        sesions: [
            {
                title: "مفاهیم اولیه",
                description: [" پیش نیاز و پشتیبانی دوره", "بررسی کاربردهای تایپ اسکریپت", "راه اندازی محیط توسعه", "نصب و بررسی ساختار پروژه", "تایپ‌های اصلی"]
            },
            {
                title: "بررسی compiler",
                description: [" استفاده از Watch Mode", "کامپایل فایل‌های متعدد", "تعیین نسخه جاوااسکریپت", "بررسی تنظیمات Libs"]
            },
            {
                title: "شی گرایی در Typescript",
                description: ["توسعه Class در تایپ اسکریپت", "کامپایل به جاوااسکریپت", "بررسی this در تایپ اسکریپت"]
            },
        ]

    },

    {
        id: 5,
        title: "آموزش React – دوره فشرده",
        status: "رایگان",
        price: "690,000 ",
        thumbnail: "/static/images/5.jpg",
        url: "/static/videos/5.mp4",
        description: "یکی از اهداف اصلی ما در فرانت کست این است که همه دوره‌ها مفاهیم کاربردی مربوط به یک زبان برنامه نویسی یا تکنولوژی را دربر بگیرند. به همین دلیل این دوره را به شکل دقیق طراحی کرده‌ایم و تمامی سرفصل‌ها منطبق بر آخرین به‌روزرسانی‌ها انتخاب شده است. همچنین نحوه تدریس در این دوره به این شکل است که آموزش از ابتدایی‌ترین مفاهیم شروع شده و مسیر یادگیری را قدم به قدم پیش می‌رویم.",
        studentsCount: "2241 دانشجو",
        timeCourse: "۲ ساعت و ۲۰ دقیقه",
        sesions: [
            {
                title: "معرفی",
                description: ["عرفی کتابخانه React", "بررسی Create React App", "راه اندازی محیط توسعه", "نصب Node"]
            },

        ]

    },
    {
        id: 6,
        title: "ساختمان داده و الگوریتم‌ها در جاوااسکریپت",
        status: "تکمیل شده",
        price: "590,000 ",
        thumbnail: "/static/images/6.jpg",
        url: "/static/videos/6.mp4",
        description: "ساختمان داده و الگوریتم‌ها یکی از مهم‌ترین مفاهیم در برنامه نویسی هستند. شرکت‌های پیشرو فناوری در مراحل استخدام و مصاحبه، تسلط بر مباحث ساختمان داده و الگوریتم‌ها را یکی از موارد بسیار مهم در نظر می‌گیرند. همین طور زمانی که به عنوان یک توسعه دهنده قصد توسعه یک نرم افزار سطح متوسط یا بزرگ را داشته باشید، قطعا دانش این دو مفهوم بسیار کاربردی خواهد بود.",
        studentsCount: "788 دانشجو",
        timeCourse: "۵ ساعت و ۱۰ دقیقه",
        sesions: [
            {
                title: "ساختمان داده",
                description: ["پیش‌ نیازهای دوره", "یادگیری دقیق‌تر مفاهیم و پشتیبانی دوره", "بررسی ساختمان داده", " آرایه‌ها – بررسی دقیق‌تر", "استفاده از Set", "مقایسه آرایه‌ها و Set", "آبجکت‌ها – بررسی دقیق‌تر"]
            },
            {
                title: "الگوریتم",
                description: ["چالش حل مسئله", " الگوریتم فیبوناچی", " پیاده سازی الگوریتم فیبوناچی", "پیاده سازی الگوریتم اعداد اول", "چالش کوچک‌ترین المنت آرایه"]
            },


        ]

    },
    {
        id: 7,
        title: "آموزش جاوااسکریپت – دوره جامع",
        status: "تکمیل شده",
        price: "650,000 ",
        thumbnail: "/static/images/7.jpg",
        url: "/static/videos/7.mp4",
        description: "وب‌سایت Stackoverflow هر سال بر اساس نظرسنجی از برنامه نویس‌ها، میزان محبوبیت تکنولوژی‌های مختلف را منتشر می‌کند. طبق گزارش منتشر شده در سال ۲۰۱۳، جاوااسکریپت از نظر میزان محبوبیت در رتبه دوم قرار گرفته بود. اما از سال ۲۰۱۴ تا ۲۰۲۱ این زبان توانست به عنوان محبوب‌ترین زبان برنامه نویسی انتخاب شود و یک روند رو به رشد داشته باشد. این روند صعودی به معنی توسعه بازار کار این زبان نیز می‌باشد. همچنین ابزارهایی مانند React و Vue.js برای توسعه View نرم افزار، Node برای توسعه نرم افزارهای بک‌اند و چهارچوب‌های موبایل مانند React Native می‌توانند از مهم‌ترین دلایل محبوبیت و کاربرد این زبان برنامه نویسی باشند.",
        studentsCount: "2050 دانشجو",
        timeCourse: "12 ساعت",
        sesions: [
            {
                title: "بررسی مفاهیم اولیه",
                description: ["معرفی دوره. بررسی سرفصل‌ها و مسیر یادگیری", "آماده سازی محیط توسعه", "متغیرها، رشته‌ها و اعداد", "بررسی شرط If", "بررسی Scope در متغیرها"]
            },
            {
                title: "جاوااسکریپت در مرورگر",
                description: ["راه اندازی وب سرور", "جاوااسکریپت در مرورگر", "بررسی DOM"]
            },
            {
                title: "مفاهیم شی گرایی",
                description: ["بررسی تابع Constructor", "ارث بری توابع", "دستور Class در جاوااسکریپت", "کلاس‌های زیرمجموعه"]
            },

        ]

    },
    {
        id: 8,
        title: "آموزش NodeJS – دوره جامع",
        status: "تکمیل شده",
        price: "630,000 ",
        thumbnail: "/static/images/8.jpg",
        url: "/static/videos/8.mp4",
        description: "NodeJS یک ابزار قدرتمند برای اجرای جاوااسکریپت در خارج از مرورگر است. در حالت عادی، زبان برنامه نویسی جاوااسکریپت توسط مرورگر تفسیر می‌شود. NodeJS این قابلیت را دارد که برنامه‌های توسعه داده شده توسط این زبان را برای هر پلتفرمی اجرا کند. یکی از این پلتفرم‌ها، بک‌اند نرم افزارهای تحت وب است. با توجه به این که NodeJS این امکان را به ما می‌دهد که از جاوااسکریپت برای توسعه بک‌اند استفاده کنیم، در نتیجه شرایط به گونه‌ای فراهم می‌شود که برای توسعه برنامه‌های وب، به جای این که از زبان های مختلف برای پیاده سازی بک‌اند و فرانت‌اند استفاده شود، از جاوااسکریپت به عنوان زبان برنامه نویسی واحد بهره‌مند شویم.",
        studentsCount: "878 دانشجو",
        timeCourse: "۶ ساعت و ۵۱ دقیقه",
        sesions: [
            {
                title: "مفاهیم اولیه",
                description: ["پیش نیاز دوره", "یادگیری بهتر و پشتیبانی دوره", "بررسی دقیق NodeJS"]
            },
            {
                title: "راه اندازی سرور",
                description: ["جریان داده در وب و توسعه بک‌اند", "ساختن سرور Node", " درک بهتر درخواست‌ها", "ارسال پاسخ به کلاینت", "مسیرهای برنامه بر اساس درخواست‌ها"]
            },


        ]

    },
]

module.exports = products